## Staging: lambda-api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 4 to add, 1 to change, 2 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_api_gateway_account.api_cloudwatch will be updated in-place
  ~ resource "aws_api_gateway_account" "api_cloudwatch" {
      ~ cloudwatch_role_arn = "arn:aws:iam::239043911459:role/HeartbeatCloudWatchRole" -> "arn:aws:iam::239043911459:role/ApiGatewayCloudWatchRole"
        id                  = "api-gateway-account"
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_base_path_mapping.api must be replaced
-/+ resource "aws_api_gateway_base_path_mapping" "api" {
      ~ domain_name = "api-lambda.staging.notification.cdssandbox.xyz" -> "api.staging.notification.cdssandbox.xyz" # forces replacement
      ~ id          = "api-lambda.staging.notification.cdssandbox.xyz/" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_api_gateway_base_path_mapping.api_lambda will be created
  + resource "aws_api_gateway_base_path_mapping" "api_lambda" {
      + api_id      = "74i43aysii"
      + domain_name = "api-lambda.staging.notification.cdssandbox.xyz"
      + id          = (known after apply)
      + stage_name  = "v1"
    }

  # aws_api_gateway_domain_name.api must be replaced
-/+ resource "aws_api_gateway_domain_name" "api" {
      ~ arn                      = "arn:aws:apigateway:ca-central-1::/domainnames/api-lambda.staging.notification.cdssandbox.xyz" -> (known after apply)
      ~ certificate_upload_date  = "2021-08-13T19:21:58Z" -> (known after apply)
      + cloudfront_domain_name   = (known after apply)
      ~ cloudfront_zone_id       = "Z2FDTNDATAQYW2" -> (known after apply)
      ~ domain_name              = "api-lambda.staging.notification.cdssandbox.xyz" -> "api.staging.notification.cdssandbox.xyz" # forces replacement
      ~ id                       = "api-lambda.staging.notification.cdssandbox.xyz" -> (known after apply)
      ~ regional_domain_name     = "d-090dye2cna.execute-api.ca-central-1.amazonaws.com" -> (known after apply)
      ~ regional_zone_id         = "Z19DQILCV0OWEC" -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_api_gateway_domain_name.api_lambda will be created
  + resource "aws_api_gateway_domain_name" "api_lambda" {
      + arn                      = (known after apply)
      + certificate_upload_date  = (known after apply)
      + cloudfront_domain_name   = (known after apply)
      + cloudfront_zone_id       = (known after apply)
      + domain_name              = "api-lambda.staging.notification.cdssandbox.xyz"
      + id                       = (known after apply)
      + regional_certificate_arn = "arn:aws:acm:ca-central-1:239043911459:certificate/b8ba5e08-2c0f-4d1a-afb1-e41accb271bb"
      + regional_domain_name     = (known after apply)
      + regional_zone_id         = (known after apply)
      + security_policy          = "TLS_1_2"
      + tags_all                 = (known after apply)

      + endpoint_configuration {
          + types = [
              + "REGIONAL",
            ]
        }
    }

Plan: 4 to add, 1 to change, 2 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

Releasing state lock. This may take a few moments...

```

</details>